{"format": "layers-model", "generatedBy": "keras v2.3.0-tf", "convertedBy": "TensorFlow.js Converter v3.2.0", "modelTopology": {"keras_version": "2.3.0-tf", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 144, 256, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input"}, "name": "input", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "193", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "193", "inbound_nodes": [[["input", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "194_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "194_pad", "inbound_nodes": [[["193", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "194", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "194", "inbound_nodes": [[["194_pad", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "195", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "195", "inbound_nodes": [[["194", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "196_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "196_pad", "inbound_nodes": [[["195", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "196", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "196", "inbound_nodes": [[["196_pad", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "197", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "197", "inbound_nodes": [[["196", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "198", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "198", "inbound_nodes": [[["197", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "199", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "199", "inbound_nodes": [[["198", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "314_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "314_pad", "inbound_nodes": [[["199", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "314", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "314", "inbound_nodes": [[["314_pad", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "202", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "202", "inbound_nodes": [[["314", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "203", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "203", "inbound_nodes": [[["202", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "204", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "204", "inbound_nodes": [[["203", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "317_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "317_pad", "inbound_nodes": [[["204", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "317", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "317", "inbound_nodes": [[["317_pad", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "207", "trainable": true, "dtype": "float32"}, "name": "207", "inbound_nodes": [[["197", 0, 0, {}], ["317", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "208", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "208", "inbound_nodes": [[["207", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "209", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "209", "inbound_nodes": [[["208", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "210", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "210", "inbound_nodes": [[["209", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "320_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "320_pad", "inbound_nodes": [[["210", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "320", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "320", "inbound_nodes": [[["320_pad", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "213", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "213", "inbound_nodes": [[["320", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "214", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "214", "inbound_nodes": [[["213", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "215", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "215", "inbound_nodes": [[["214", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "323_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "323_pad", "inbound_nodes": [[["215", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "323", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "323", "inbound_nodes": [[["323_pad", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "218", "trainable": true, "dtype": "float32"}, "name": "218", "inbound_nodes": [[["208", 0, 0, {}], ["323", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "219", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "219", "inbound_nodes": [[["218", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "220", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "220", "inbound_nodes": [[["219", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "221", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "221", "inbound_nodes": [[["220", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "326_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "326_pad", "inbound_nodes": [[["221", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "326", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "326", "inbound_nodes": [[["326_pad", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "224", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "224", "inbound_nodes": [[["326", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "225", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "225", "inbound_nodes": [[["224", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "226", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "226", "inbound_nodes": [[["225", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "329_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "329_pad", "inbound_nodes": [[["226", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "329", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "329", "inbound_nodes": [[["329_pad", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "229", "trainable": true, "dtype": "float32"}, "name": "229", "inbound_nodes": [[["219", 0, 0, {}], ["329", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "230", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "230", "inbound_nodes": [[["229", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "231_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "231_pad", "inbound_nodes": [[["230", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "231", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "231", "inbound_nodes": [[["231_pad", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "232", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "232", "inbound_nodes": [[["231", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "332_pad", "trainable": true, "dtype": "float32", "padding": [[2, 2], [2, 2]], "data_format": "channels_last"}, "name": "332_pad", "inbound_nodes": [[["232", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "335_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "335_pad", "inbound_nodes": [[["232", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "332", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [2, 2], "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "332", "inbound_nodes": [[["332_pad", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "335", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "335", "inbound_nodes": [[["335_pad", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "235", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "235", "inbound_nodes": [[["332", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "238", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "238", "inbound_nodes": [[["335", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "239", "trainable": true, "dtype": "float32"}, "name": "239", "inbound_nodes": [[["235", 0, 0, {}], ["238", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "240", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "240", "inbound_nodes": [[["239", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "241", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "241", "inbound_nodes": [[["240", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "338_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "338_pad", "inbound_nodes": [[["241", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "338", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "338", "inbound_nodes": [[["338_pad", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "244", "trainable": true, "dtype": "float32"}, "name": "244", "inbound_nodes": [[["232", 0, 0, {}], ["338", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "245", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "245", "inbound_nodes": [[["244", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "341_pad", "trainable": true, "dtype": "float32", "padding": [[4, 4], [4, 4]], "data_format": "channels_last"}, "name": "341_pad", "inbound_nodes": [[["245", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "344_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "344_pad", "inbound_nodes": [[["245", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "341", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [4, 4], "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "341", "inbound_nodes": [[["341_pad", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "344", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "344", "inbound_nodes": [[["344_pad", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "248", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "248", "inbound_nodes": [[["341", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "251", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "251", "inbound_nodes": [[["344", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "252", "trainable": true, "dtype": "float32"}, "name": "252", "inbound_nodes": [[["248", 0, 0, {}], ["251", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "253", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "253", "inbound_nodes": [[["252", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "254", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "254", "inbound_nodes": [[["253", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "347_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "347_pad", "inbound_nodes": [[["254", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "347", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "347", "inbound_nodes": [[["347_pad", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "257", "trainable": true, "dtype": "float32"}, "name": "257", "inbound_nodes": [[["245", 0, 0, {}], ["347", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "258", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "258", "inbound_nodes": [[["257", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "350_pad", "trainable": true, "dtype": "float32", "padding": [[8, 8], [8, 8]], "data_format": "channels_last"}, "name": "350_pad", "inbound_nodes": [[["258", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "353_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "353_pad", "inbound_nodes": [[["258", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "350", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [8, 8], "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "350", "inbound_nodes": [[["350_pad", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "353", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "353", "inbound_nodes": [[["353_pad", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "261", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "261", "inbound_nodes": [[["350", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "264", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "264", "inbound_nodes": [[["353", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "265", "trainable": true, "dtype": "float32"}, "name": "265", "inbound_nodes": [[["261", 0, 0, {}], ["264", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "266", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "266", "inbound_nodes": [[["265", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "267", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "267", "inbound_nodes": [[["266", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "356_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "356_pad", "inbound_nodes": [[["267", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "356", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "356", "inbound_nodes": [[["356_pad", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "270", "trainable": true, "dtype": "float32"}, "name": "270", "inbound_nodes": [[["258", 0, 0, {}], ["356", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "271", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "271", "inbound_nodes": [[["270", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "359_pad", "trainable": true, "dtype": "float32", "padding": [[2, 2], [2, 2]], "data_format": "channels_last"}, "name": "359_pad", "inbound_nodes": [[["271", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "362_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "362_pad", "inbound_nodes": [[["271", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "359", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [2, 2], "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "359", "inbound_nodes": [[["359_pad", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "362", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "362", "inbound_nodes": [[["362_pad", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "274", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "274", "inbound_nodes": [[["359", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "277", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "277", "inbound_nodes": [[["362", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "278", "trainable": true, "dtype": "float32"}, "name": "278", "inbound_nodes": [[["274", 0, 0, {}], ["277", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "279", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "279", "inbound_nodes": [[["278", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "280", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "280", "inbound_nodes": [[["279", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "365_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "365_pad", "inbound_nodes": [[["280", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "365", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "365", "inbound_nodes": [[["365_pad", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "283", "trainable": true, "dtype": "float32"}, "name": "283", "inbound_nodes": [[["271", 0, 0, {}], ["365", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "284", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "284", "inbound_nodes": [[["283", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "368_pad", "trainable": true, "dtype": "float32", "padding": [[4, 4], [4, 4]], "data_format": "channels_last"}, "name": "368_pad", "inbound_nodes": [[["284", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "371_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "371_pad", "inbound_nodes": [[["284", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "368", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [4, 4], "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "368", "inbound_nodes": [[["368_pad", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "371", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "371", "inbound_nodes": [[["371_pad", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "287", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "287", "inbound_nodes": [[["368", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "290", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "290", "inbound_nodes": [[["371", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "291", "trainable": true, "dtype": "float32"}, "name": "291", "inbound_nodes": [[["287", 0, 0, {}], ["290", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "292", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "292", "inbound_nodes": [[["291", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "293", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "293", "inbound_nodes": [[["292", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "374_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "374_pad", "inbound_nodes": [[["293", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "374", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "374", "inbound_nodes": [[["374_pad", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "296", "trainable": true, "dtype": "float32"}, "name": "296", "inbound_nodes": [[["284", 0, 0, {}], ["374", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "297", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "297", "inbound_nodes": [[["296", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "377_pad", "trainable": true, "dtype": "float32", "padding": [[8, 8], [8, 8]], "data_format": "channels_last"}, "name": "377_pad", "inbound_nodes": [[["297", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "380_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "380_pad", "inbound_nodes": [[["297", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "377", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [8, 8], "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "377", "inbound_nodes": [[["377_pad", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "380", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "380", "inbound_nodes": [[["380_pad", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "300", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "300", "inbound_nodes": [[["377", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "303", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "303", "inbound_nodes": [[["380", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "304", "trainable": true, "dtype": "float32"}, "name": "304", "inbound_nodes": [[["300", 0, 0, {}], ["303", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "305", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "305", "inbound_nodes": [[["304", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "306", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "306", "inbound_nodes": [[["305", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "383_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "383_pad", "inbound_nodes": [[["306", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "383", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "383", "inbound_nodes": [[["383_pad", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "309", "trainable": true, "dtype": "float32"}, "name": "309", "inbound_nodes": [[["297", 0, 0, {}], ["383", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "310", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "310", "inbound_nodes": [[["309", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "311", "trainable": true, "dtype": "float32", "filters": 1, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "311", "inbound_nodes": [[["310", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "312", "trainable": true, "dtype": "float32", "filters": 1, "kernel_size": [16, 16], "strides": [8, 8], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": [0, 0]}, "name": "312", "inbound_nodes": [[["311", 0, 0, {}]]]}, {"class_name": "Cropping2D", "config": {"name": "312_crop", "trainable": true, "dtype": "float32", "cropping": [[4, 4], [4, 4]], "data_format": "channels_last"}, "name": "312_crop", "inbound_nodes": [[["312", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "output", "trainable": true, "dtype": "float32", "activation": "sigmoid"}, "name": "output", "inbound_nodes": [[["312_crop", 0, 0, {}]]]}], "input_layers": [["input", 0, 0]], "output_layers": [["output", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "193/kernel", "shape": [1, 1, 3, 3], "dtype": "float32"}, {"name": "193/bias", "shape": [3], "dtype": "float32"}, {"name": "194/kernel", "shape": [3, 3, 3, 16], "dtype": "float32"}, {"name": "194/bias", "shape": [16], "dtype": "float32"}, {"name": "196/kernel", "shape": [3, 3, 16, 32], "dtype": "float32"}, {"name": "196/bias", "shape": [32], "dtype": "float32"}, {"name": "198/kernel", "shape": [1, 1, 32, 32], "dtype": "float32"}, {"name": "203/kernel", "shape": [1, 1, 32, 32], "dtype": "float32"}, {"name": "209/kernel", "shape": [1, 1, 32, 32], "dtype": "float32"}, {"name": "214/kernel", "shape": [1, 1, 32, 32], "dtype": "float32"}, {"name": "220/kernel", "shape": [1, 1, 32, 32], "dtype": "float32"}, {"name": "225/kernel", "shape": [1, 1, 32, 32], "dtype": "float32"}, {"name": "231/kernel", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "231/bias", "shape": [64], "dtype": "float32"}, {"name": "240/kernel", "shape": [1, 1, 64, 64], "dtype": "float32"}, {"name": "253/kernel", "shape": [1, 1, 64, 64], "dtype": "float32"}, {"name": "266/kernel", "shape": [1, 1, 64, 64], "dtype": "float32"}, {"name": "279/kernel", "shape": [1, 1, 64, 64], "dtype": "float32"}, {"name": "292/kernel", "shape": [1, 1, 64, 64], "dtype": "float32"}, {"name": "305/kernel", "shape": [1, 1, 64, 64], "dtype": "float32"}, {"name": "311/kernel", "shape": [1, 1, 64, 1], "dtype": "float32"}, {"name": "311/bias", "shape": [1], "dtype": "float32"}, {"name": "312/kernel", "shape": [16, 16, 1, 1], "dtype": "float32"}, {"name": "314/depthwise_kernel", "shape": [3, 3, 32, 1], "dtype": "float32"}, {"name": "314/bias", "shape": [32], "dtype": "float32"}, {"name": "317/depthwise_kernel", "shape": [3, 3, 32, 1], "dtype": "float32"}, {"name": "317/bias", "shape": [32], "dtype": "float32"}, {"name": "320/depthwise_kernel", "shape": [3, 3, 32, 1], "dtype": "float32"}, {"name": "320/bias", "shape": [32], "dtype": "float32"}, {"name": "323/depthwise_kernel", "shape": [3, 3, 32, 1], "dtype": "float32"}, {"name": "323/bias", "shape": [32], "dtype": "float32"}, {"name": "326/depthwise_kernel", "shape": [3, 3, 32, 1], "dtype": "float32"}, {"name": "326/bias", "shape": [32], "dtype": "float32"}, {"name": "329/depthwise_kernel", "shape": [3, 3, 32, 1], "dtype": "float32"}, {"name": "329/bias", "shape": [32], "dtype": "float32"}, {"name": "332/depthwise_kernel", "shape": [3, 3, 64, 1], "dtype": "float32"}, {"name": "332/bias", "shape": [64], "dtype": "float32"}, {"name": "335/depthwise_kernel", "shape": [3, 3, 64, 1], "dtype": "float32"}, {"name": "335/bias", "shape": [64], "dtype": "float32"}, {"name": "338/depthwise_kernel", "shape": [3, 3, 64, 1], "dtype": "float32"}, {"name": "338/bias", "shape": [64], "dtype": "float32"}, {"name": "341/depthwise_kernel", "shape": [3, 3, 64, 1], "dtype": "float32"}, {"name": "341/bias", "shape": [64], "dtype": "float32"}, {"name": "344/depthwise_kernel", "shape": [3, 3, 64, 1], "dtype": "float32"}, {"name": "344/bias", "shape": [64], "dtype": "float32"}, {"name": "347/depthwise_kernel", "shape": [3, 3, 64, 1], "dtype": "float32"}, {"name": "347/bias", "shape": [64], "dtype": "float32"}, {"name": "350/depthwise_kernel", "shape": [3, 3, 64, 1], "dtype": "float32"}, {"name": "350/bias", "shape": [64], "dtype": "float32"}, {"name": "353/depthwise_kernel", "shape": [3, 3, 64, 1], "dtype": "float32"}, {"name": "353/bias", "shape": [64], "dtype": "float32"}, {"name": "356/depthwise_kernel", "shape": [3, 3, 64, 1], "dtype": "float32"}, {"name": "356/bias", "shape": [64], "dtype": "float32"}, {"name": "359/depthwise_kernel", "shape": [3, 3, 64, 1], "dtype": "float32"}, {"name": "359/bias", "shape": [64], "dtype": "float32"}, {"name": "362/depthwise_kernel", "shape": [3, 3, 64, 1], "dtype": "float32"}, {"name": "362/bias", "shape": [64], "dtype": "float32"}, {"name": "365/depthwise_kernel", "shape": [3, 3, 64, 1], "dtype": "float32"}, {"name": "365/bias", "shape": [64], "dtype": "float32"}, {"name": "368/depthwise_kernel", "shape": [3, 3, 64, 1], "dtype": "float32"}, {"name": "368/bias", "shape": [64], "dtype": "float32"}, {"name": "371/depthwise_kernel", "shape": [3, 3, 64, 1], "dtype": "float32"}, {"name": "371/bias", "shape": [64], "dtype": "float32"}, {"name": "374/depthwise_kernel", "shape": [3, 3, 64, 1], "dtype": "float32"}, {"name": "374/bias", "shape": [64], "dtype": "float32"}, {"name": "377/depthwise_kernel", "shape": [3, 3, 64, 1], "dtype": "float32"}, {"name": "377/bias", "shape": [64], "dtype": "float32"}, {"name": "380/depthwise_kernel", "shape": [3, 3, 64, 1], "dtype": "float32"}, {"name": "380/bias", "shape": [64], "dtype": "float32"}, {"name": "383/depthwise_kernel", "shape": [3, 3, 64, 1], "dtype": "float32"}, {"name": "383/bias", "shape": [64], "dtype": "float32"}]}]}