{"format": "layers-model", "generatedBy": "keras v2.3.0-tf", "convertedBy": "TensorFlow.js Converter v2.0.1.post1", "modelTopology": {"keras_version": "2.3.0-tf", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 144, 256, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input"}, "name": "input", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "234", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "234", "inbound_nodes": [[["input", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "235_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "235_pad", "inbound_nodes": [[["234", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "235", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "235", "inbound_nodes": [[["235_pad", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "236", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "236", "inbound_nodes": [[["235", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "237_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "237_pad", "inbound_nodes": [[["236", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "237", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "237", "inbound_nodes": [[["237_pad", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "238", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "238", "inbound_nodes": [[["237", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "239_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "239_pad", "inbound_nodes": [[["238", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "239", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "239", "inbound_nodes": [[["239_pad", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "240", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "240", "inbound_nodes": [[["239", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "241", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "241", "inbound_nodes": [[["240", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "243", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "243", "inbound_nodes": [[["241", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "244_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "244_pad", "inbound_nodes": [[["243", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "244", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "244", "inbound_nodes": [[["244_pad", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "245", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "245", "inbound_nodes": [[["244", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "246", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "246", "inbound_nodes": [[["245", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "248", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "248", "inbound_nodes": [[["238", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "250", "trainable": true, "dtype": "float32"}, "name": "250", "inbound_nodes": [[["246", 0, 0, {}], ["248", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "251", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "251", "inbound_nodes": [[["250", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "252_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "252_pad", "inbound_nodes": [[["251", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "252", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "252", "inbound_nodes": [[["252_pad", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "253", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "253", "inbound_nodes": [[["252", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "254", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "254", "inbound_nodes": [[["253", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "256", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "256", "inbound_nodes": [[["254", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "257_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "257_pad", "inbound_nodes": [[["256", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "257", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "257", "inbound_nodes": [[["257_pad", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "258", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "258", "inbound_nodes": [[["257", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "259", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "259", "inbound_nodes": [[["258", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "261", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "261", "inbound_nodes": [[["251", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "263", "trainable": true, "dtype": "float32"}, "name": "263", "inbound_nodes": [[["259", 0, 0, {}], ["261", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "264", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "264", "inbound_nodes": [[["263", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "265_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "265_pad", "inbound_nodes": [[["264", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "265", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "265", "inbound_nodes": [[["265_pad", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "266", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "266", "inbound_nodes": [[["265", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "267", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "267", "inbound_nodes": [[["266", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "269", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "269", "inbound_nodes": [[["267", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "270_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "270_pad", "inbound_nodes": [[["269", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "270", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "270", "inbound_nodes": [[["270_pad", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "271", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "271", "inbound_nodes": [[["270", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "272", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "272", "inbound_nodes": [[["271", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "274", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "274", "inbound_nodes": [[["264", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "276", "trainable": true, "dtype": "float32"}, "name": "276", "inbound_nodes": [[["272", 0, 0, {}], ["274", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "277", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "277", "inbound_nodes": [[["276", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "278_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "278_pad", "inbound_nodes": [[["277", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "278", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "278", "inbound_nodes": [[["278_pad", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "279", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "279", "inbound_nodes": [[["278", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "280_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "280_pad", "inbound_nodes": [[["279", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "280", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "280", "inbound_nodes": [[["280_pad", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "281", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "281", "inbound_nodes": [[["280", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "282", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "282", "inbound_nodes": [[["281", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "284", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "284", "inbound_nodes": [[["282", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "285_pad", "trainable": true, "dtype": "float32", "padding": [[2, 2], [2, 2]], "data_format": "channels_last"}, "name": "285_pad", "inbound_nodes": [[["284", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "285", "trainable": true, "dtype": "float32", "kernel_size": [5, 5], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "285", "inbound_nodes": [[["285_pad", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "287", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "287", "inbound_nodes": [[["285", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "288", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "288", "inbound_nodes": [[["287", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "290", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "290", "inbound_nodes": [[["279", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "292", "trainable": true, "dtype": "float32"}, "name": "292", "inbound_nodes": [[["288", 0, 0, {}], ["290", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "293", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "293", "inbound_nodes": [[["292", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "294_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "294_pad", "inbound_nodes": [[["293", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "294", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "294", "inbound_nodes": [[["294_pad", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "295", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "295", "inbound_nodes": [[["294", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "296", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "296", "inbound_nodes": [[["295", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "298", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "298", "inbound_nodes": [[["296", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "299_pad", "trainable": true, "dtype": "float32", "padding": [[2, 2], [2, 2]], "data_format": "channels_last"}, "name": "299_pad", "inbound_nodes": [[["298", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "299", "trainable": true, "dtype": "float32", "kernel_size": [5, 5], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "299", "inbound_nodes": [[["299_pad", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "301", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "301", "inbound_nodes": [[["299", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "302", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "302", "inbound_nodes": [[["301", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "304", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "304", "inbound_nodes": [[["293", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "306", "trainable": true, "dtype": "float32"}, "name": "306", "inbound_nodes": [[["302", 0, 0, {}], ["304", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "307", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "307", "inbound_nodes": [[["306", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "308_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "308_pad", "inbound_nodes": [[["307", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "308", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "308", "inbound_nodes": [[["308_pad", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "309", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "309", "inbound_nodes": [[["308", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "310", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "310", "inbound_nodes": [[["309", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "312", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "312", "inbound_nodes": [[["310", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "313_pad", "trainable": true, "dtype": "float32", "padding": [[2, 2], [2, 2]], "data_format": "channels_last"}, "name": "313_pad", "inbound_nodes": [[["312", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "313", "trainable": true, "dtype": "float32", "kernel_size": [5, 5], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "313", "inbound_nodes": [[["313_pad", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "315", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "315", "inbound_nodes": [[["313", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "316", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "316", "inbound_nodes": [[["315", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "318", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "318", "inbound_nodes": [[["307", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "320", "trainable": true, "dtype": "float32"}, "name": "320", "inbound_nodes": [[["316", 0, 0, {}], ["318", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "321", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "321", "inbound_nodes": [[["320", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "322_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "322_pad", "inbound_nodes": [[["321", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "322", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "322", "inbound_nodes": [[["322_pad", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "323", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "323", "inbound_nodes": [[["322", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "324", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "324", "inbound_nodes": [[["323", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "326", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "326", "inbound_nodes": [[["324", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "327_pad", "trainable": true, "dtype": "float32", "padding": [[2, 2], [2, 2]], "data_format": "channels_last"}, "name": "327_pad", "inbound_nodes": [[["326", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "327", "trainable": true, "dtype": "float32", "kernel_size": [5, 5], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "327", "inbound_nodes": [[["327_pad", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "329", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "329", "inbound_nodes": [[["327", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "330", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "330", "inbound_nodes": [[["329", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "332", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "332", "inbound_nodes": [[["321", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "334", "trainable": true, "dtype": "float32"}, "name": "334", "inbound_nodes": [[["330", 0, 0, {}], ["332", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "335", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "335", "inbound_nodes": [[["334", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "336_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "336_pad", "inbound_nodes": [[["335", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "336", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "336", "inbound_nodes": [[["336_pad", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "337", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "337", "inbound_nodes": [[["336", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "338", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "338", "inbound_nodes": [[["337", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "340", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "340", "inbound_nodes": [[["338", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "341_pad", "trainable": true, "dtype": "float32", "padding": [[2, 2], [2, 2]], "data_format": "channels_last"}, "name": "341_pad", "inbound_nodes": [[["340", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "341", "trainable": true, "dtype": "float32", "kernel_size": [5, 5], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "341", "inbound_nodes": [[["341_pad", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "343", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "343", "inbound_nodes": [[["341", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "344", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "344", "inbound_nodes": [[["343", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "346", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "346", "inbound_nodes": [[["335", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "348", "trainable": true, "dtype": "float32"}, "name": "348", "inbound_nodes": [[["344", 0, 0, {}], ["346", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "349", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "349", "inbound_nodes": [[["348", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "350_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "350_pad", "inbound_nodes": [[["349", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "350", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "350", "inbound_nodes": [[["350_pad", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "351", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "351", "inbound_nodes": [[["350", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "352", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "352", "inbound_nodes": [[["351", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "354", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "354", "inbound_nodes": [[["352", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "355_pad", "trainable": true, "dtype": "float32", "padding": [[2, 2], [2, 2]], "data_format": "channels_last"}, "name": "355_pad", "inbound_nodes": [[["354", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "355", "trainable": true, "dtype": "float32", "kernel_size": [5, 5], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "355", "inbound_nodes": [[["355_pad", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "357", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "357", "inbound_nodes": [[["355", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "358", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "358", "inbound_nodes": [[["357", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "360", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "360", "inbound_nodes": [[["349", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "362", "trainable": true, "dtype": "float32"}, "name": "362", "inbound_nodes": [[["358", 0, 0, {}], ["360", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "363", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "363", "inbound_nodes": [[["362", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "364", "trainable": true, "dtype": "float32", "filters": 1, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "364", "inbound_nodes": [[["363", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "365", "trainable": true, "dtype": "float32", "filters": 1, "kernel_size": [16, 16], "strides": [8, 8], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": [0, 0]}, "name": "365", "inbound_nodes": [[["364", 0, 0, {}]]]}, {"class_name": "Cropping2D", "config": {"name": "365_crop", "trainable": true, "dtype": "float32", "cropping": [[4, 4], [4, 4]], "data_format": "channels_last"}, "name": "365_crop", "inbound_nodes": [[["365", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "output", "trainable": true, "dtype": "float32", "activation": "sigmoid"}, "name": "output", "inbound_nodes": [[["365_crop", 0, 0, {}]]]}], "input_layers": [["input", 0, 0]], "output_layers": [["output", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "234/kernel", "shape": [1, 1, 3, 3], "dtype": "float32"}, {"name": "234/bias", "shape": [3], "dtype": "float32"}, {"name": "235/kernel", "shape": [3, 3, 3, 16], "dtype": "float32"}, {"name": "235/bias", "shape": [16], "dtype": "float32"}, {"name": "237/kernel", "shape": [3, 3, 16, 32], "dtype": "float32"}, {"name": "237/bias", "shape": [32], "dtype": "float32"}, {"name": "239/depthwise_kernel", "shape": [3, 3, 32, 1], "dtype": "float32"}, {"name": "239/bias", "shape": [32], "dtype": "float32"}, {"name": "241/kernel", "shape": [1, 1, 32, 32], "dtype": "float32"}, {"name": "241/bias", "shape": [32], "dtype": "float32"}, {"name": "244/depthwise_kernel", "shape": [3, 3, 32, 1], "dtype": "float32"}, {"name": "244/bias", "shape": [32], "dtype": "float32"}, {"name": "246/kernel", "shape": [1, 1, 32, 32], "dtype": "float32"}, {"name": "246/bias", "shape": [32], "dtype": "float32"}, {"name": "248/kernel", "shape": [1, 1, 32, 32], "dtype": "float32"}, {"name": "248/bias", "shape": [32], "dtype": "float32"}, {"name": "252/depthwise_kernel", "shape": [3, 3, 32, 1], "dtype": "float32"}, {"name": "252/bias", "shape": [32], "dtype": "float32"}, {"name": "254/kernel", "shape": [1, 1, 32, 32], "dtype": "float32"}, {"name": "254/bias", "shape": [32], "dtype": "float32"}, {"name": "257/depthwise_kernel", "shape": [3, 3, 32, 1], "dtype": "float32"}, {"name": "257/bias", "shape": [32], "dtype": "float32"}, {"name": "259/kernel", "shape": [1, 1, 32, 32], "dtype": "float32"}, {"name": "259/bias", "shape": [32], "dtype": "float32"}, {"name": "261/kernel", "shape": [1, 1, 32, 32], "dtype": "float32"}, {"name": "261/bias", "shape": [32], "dtype": "float32"}, {"name": "265/depthwise_kernel", "shape": [3, 3, 32, 1], "dtype": "float32"}, {"name": "265/bias", "shape": [32], "dtype": "float32"}, {"name": "267/kernel", "shape": [1, 1, 32, 32], "dtype": "float32"}, {"name": "267/bias", "shape": [32], "dtype": "float32"}, {"name": "270/depthwise_kernel", "shape": [3, 3, 32, 1], "dtype": "float32"}, {"name": "270/bias", "shape": [32], "dtype": "float32"}, {"name": "272/kernel", "shape": [1, 1, 32, 32], "dtype": "float32"}, {"name": "272/bias", "shape": [32], "dtype": "float32"}, {"name": "274/kernel", "shape": [1, 1, 32, 32], "dtype": "float32"}, {"name": "274/bias", "shape": [32], "dtype": "float32"}, {"name": "278/kernel", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "278/bias", "shape": [64], "dtype": "float32"}, {"name": "280/depthwise_kernel", "shape": [3, 3, 64, 1], "dtype": "float32"}, {"name": "280/bias", "shape": [64], "dtype": "float32"}, {"name": "282/kernel", "shape": [1, 1, 64, 64], "dtype": "float32"}, {"name": "282/bias", "shape": [64], "dtype": "float32"}, {"name": "285/depthwise_kernel", "shape": [5, 5, 64, 1], "dtype": "float32"}, {"name": "285/bias", "shape": [64], "dtype": "float32"}, {"name": "288/kernel", "shape": [1, 1, 64, 64], "dtype": "float32"}, {"name": "288/bias", "shape": [64], "dtype": "float32"}, {"name": "290/kernel", "shape": [1, 1, 64, 64], "dtype": "float32"}, {"name": "290/bias", "shape": [64], "dtype": "float32"}, {"name": "294/depthwise_kernel", "shape": [3, 3, 64, 1], "dtype": "float32"}, {"name": "294/bias", "shape": [64], "dtype": "float32"}, {"name": "296/kernel", "shape": [1, 1, 64, 64], "dtype": "float32"}, {"name": "296/bias", "shape": [64], "dtype": "float32"}, {"name": "299/depthwise_kernel", "shape": [5, 5, 64, 1], "dtype": "float32"}, {"name": "299/bias", "shape": [64], "dtype": "float32"}, {"name": "302/kernel", "shape": [1, 1, 64, 64], "dtype": "float32"}, {"name": "302/bias", "shape": [64], "dtype": "float32"}, {"name": "304/kernel", "shape": [1, 1, 64, 64], "dtype": "float32"}, {"name": "304/bias", "shape": [64], "dtype": "float32"}, {"name": "308/depthwise_kernel", "shape": [3, 3, 64, 1], "dtype": "float32"}, {"name": "308/bias", "shape": [64], "dtype": "float32"}, {"name": "310/kernel", "shape": [1, 1, 64, 64], "dtype": "float32"}, {"name": "310/bias", "shape": [64], "dtype": "float32"}, {"name": "313/depthwise_kernel", "shape": [5, 5, 64, 1], "dtype": "float32"}, {"name": "313/bias", "shape": [64], "dtype": "float32"}, {"name": "316/kernel", "shape": [1, 1, 64, 64], "dtype": "float32"}, {"name": "316/bias", "shape": [64], "dtype": "float32"}, {"name": "318/kernel", "shape": [1, 1, 64, 64], "dtype": "float32"}, {"name": "318/bias", "shape": [64], "dtype": "float32"}, {"name": "322/depthwise_kernel", "shape": [3, 3, 64, 1], "dtype": "float32"}, {"name": "322/bias", "shape": [64], "dtype": "float32"}, {"name": "324/kernel", "shape": [1, 1, 64, 64], "dtype": "float32"}, {"name": "324/bias", "shape": [64], "dtype": "float32"}, {"name": "327/depthwise_kernel", "shape": [5, 5, 64, 1], "dtype": "float32"}, {"name": "327/bias", "shape": [64], "dtype": "float32"}, {"name": "330/kernel", "shape": [1, 1, 64, 64], "dtype": "float32"}, {"name": "330/bias", "shape": [64], "dtype": "float32"}, {"name": "332/kernel", "shape": [1, 1, 64, 64], "dtype": "float32"}, {"name": "332/bias", "shape": [64], "dtype": "float32"}, {"name": "336/depthwise_kernel", "shape": [3, 3, 64, 1], "dtype": "float32"}, {"name": "336/bias", "shape": [64], "dtype": "float32"}, {"name": "338/kernel", "shape": [1, 1, 64, 64], "dtype": "float32"}, {"name": "338/bias", "shape": [64], "dtype": "float32"}, {"name": "341/depthwise_kernel", "shape": [5, 5, 64, 1], "dtype": "float32"}, {"name": "341/bias", "shape": [64], "dtype": "float32"}, {"name": "344/kernel", "shape": [1, 1, 64, 64], "dtype": "float32"}, {"name": "344/bias", "shape": [64], "dtype": "float32"}, {"name": "346/kernel", "shape": [1, 1, 64, 64], 